---

# 联系方式
- 手机：15810957053
- Email：lxzo123@gmail.com 

---

# 个人信息

 - 郑晓洛/男/1984 
 - 本科/郑州轻工业学院网络工程专业 
 - 工作年限：9年
 - 技术博客：http://blog.csdn.net/lxzo123
 - Github：https://github.com/xiaolezheng

 - 期望职位：系统架构师，技术经理，JAVA开发
 - 期望城市：北京

---

# 工作经历

## 北京奇鱼时代 （ 2015年8月 ~ 至今 ）
主要负责SAAS账号系统、搜索系统、商务系统、开放平台等模块的日常开发管理工作，技术方案设计，线上服务优化，对开发技术方案进行把控，code review，协调其他团队共同完成版本的正常迭代发布。

### 云表单项目 
负责云表单系统服务端的主要模块开发工作，参与日常需求评审方案设计，codereview，主要模块编码，云表单为中小企业提供进销存管理，配置化实现业务流程。

## 去哪儿网 （ 2013年12月 ~ 2015年7月 ）
负责酒店分销系统HDS的设计开发，酒店供应链SCM系统的设计开发工作

### 供应链系统项目 
主要负责供应链系统的设计和开发，主导并推进系统业务模型的演进和重构，见证了供应链项目从单体应用到服务化分布式架构演变的整个过程，酒店供应链范畴下的系统有很多，包括基础信息（门店、酒店），客户信息，CRM，合同(ct)，结算(hsc)，产品报价房态(qta，tuan)等大部分围绕商家维度的B端系统，也就是广义的供应链系统。

### HDS分销系统项目 
主要负责酒店分销系统HDS的日常设计开发，分销开放平台SDK的设计开发，该项目为对去哪儿网酒店剩余库存进行分销处理，提供开放API给分销商开发使用，其中参与了运营管理平台，分销商下单结算平台，API开放平台的设计开发工作。

## 敦煌网 （2011年05~2013年11）
主要负责敦煌网开放平台项目，以及服务集成线日常工作，其中主导了开放平台架构设计及主要开发工作，参与了应用服务化拆分项目，商品库拆分项目，应用监控报警项目，应用自动化部署项目等相关项目。

### 开放平台项目
负责系统整体架构设计，环境搭建，主要模块开发，该项目为敦煌网线上业务的api开放平台，对线上业务以api的形式开放出去，并对api的使用从各个维度进行管控，从而为第三方提供更好更便捷的服务。

### 商品库拆分服务化项目
负责部分系统模块设计开发，该项目为商品库相关表从oracle迁移到mysql库，并对原来的大表进行拆分为若干小表，同时对商品相关服务进行拆分，减少服务依赖耦合度，降低单点故障，提高系统稳定性。

## 搜狐网 （2008年03~2011年04）
参与无线相关产品开发，媒体IVR平台改造，REDIS短信队列，REDIS新闻平台，终端数据BI平台建设，渠道数据同步平台等相关项目

## 郑州信源计算机有限公司 （2007年10~2008年02实习）
郑州信源计算机有限公司实习，任职软件开发工程师，参与了公司产品政府投标系统相关模块的开发测试工作

---

# 技能清单

- 具有互联网高并发、分布式系统架构、系统优化经验
- 熟悉spring、mybatis、guava、guice等常用开发框架，java并发多线程
- 熟悉dubbo、JbossRemote等rpc框架、RabbitMq、Kafka等消息队列
- 熟悉redis、memcached、有redis、memcached大规模线上使用经验
- 熟悉Jetty、Tomcat、nginx服务器运维经验
- 熟悉MySql、Oracle数据库、sql优化、数据库结构设计、mongodb存储
- 熟悉linux系统、linux常用命令、简单shell、python、go编程
- 熟悉Git、SVN、maven等开发常用工具

# 自我评价

为人诚信开朗，责任感强，能承受一定压力，有带领团队经验，具有一定的英语阅读能力，热爱运动，喜欢编程，有阅读源码精神，较强的自学，解决问题能力，9年java开发经验，7年互联网行业经验，熟悉sql优化，善于高并发分布式应用架构、性能优化，目前正在学习机器学习。

## 参考技能关键字

- java
- web
- mysql
- redis
- memcached
- mongodb
- mq
- linux
- oracle
- spring
- mybatis
- sql
- soa
- restful
- jetty
- tomcat
- nginx
- rpc
- git
- maven

---

# 致谢
期待能有机会和您共事。
